app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-20 20:23:28.145923"], ["name", "JROTC"], ["updated_at", "2014-09-20 20:23:28.145923"]]
---
  def create
    @category = Category.new(params.require(:category).permit(:name))
    if @category.save