app/controllers/questions_controller.rb

  def new
    @question = Question.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @question = Question.new(params.require(:question).permit(:category_id, :question, :answer, :false_answers))
    if @question.save
---
INSERT INTO "questions" ("answer", "category_id", "created_at", "question", "question_format_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)