app/controllers/question_formats_controller.rb

SELECT "question_formats".* FROM "question_formats"
---
  def index
    @question_formats = QuestionFormat.all

INSERT INTO "question_formats" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-20 21:18:30.937611"], ["name", "Fill in the Blank"], ["updated_at", "2014-09-20 21:18:30.937611"]]
---
  def create
    @question_format = QuestionFormat.new(params.require(:question_format).permit(:name))
    if @question_format.save